{
  "filename": "blog1.md",
  "__html": "<h1>Kruise Controller Classification Guidance</h1>\n<p>By FEI GUO (Alibaba), OCTOBOR 10 2019, 8 MINUTE READ</p>\n<p>Kubernetes does not provide a clear guidance about which controller is the best fit for\na user application. Sometimes, this does not seem to be a big problem if users understand\nboth the application and workload well. For example, users usually know when to choose\n<code>Job/CronJob</code> or <code>DaemonSet</code> since the concepts of these workload are straightforward -\nthe former is designed for temporal batch style applications and the latter is suitable\nfor long running Pod which is distributed in every node. On the other hand, the usage\nboundary between <code>Deployment</code> and <code>StatefulSet</code> is vague. An application managed by\na <code>Deployment</code> conceptually can be managed by a <code>StatefulSet</code> as well, the opposite may\nalso apply as long as the Pod <code>OrderedReady</code> capability of <code>StatefulSet</code> is not mandatory.\nFurthermore, as more and more customized controllers/operators become available in Kubernetes\ncommunity, finding suitable controller can be a nonnegligible user problem especially\nwhen some controllers have functional overlaps.</p>\n<p>Kruise attempts to mitigate the problem from two aspects:</p>\n<ul>\n<li>Carefully design the new controllers in the Kruise suite to avoid unnecessary functional\nduplications that may confuse users.</li>\n<li>Establish a classification mechanism for existing workload controllers so that user\ncan more easily understand the use cases of them. We will elaborate this more in this\npost. The first and most intuitive criterion for classification is the controller name.</li>\n</ul>\n<h3>Controller Name Convention</h3>\n<p>An easily understandable controller name can certainly help adoption. After consulting\nwith many internal/external Kubernetes users, we decide to use the following naming\nconventions in Kruise. Note that these conventions are not contradicted with the controller\nnames used in upstream controllers.</p>\n<ul>\n<li>\n<p><strong>Set</strong> -suffix names: This type of controller manages Pods directly. Examples\ninclude <code>Advanced StatefulSet</code>, <code>ReplicaSet</code> and <code>SidecarSet</code>. It supports\nvarious depolyment/rollout strategies in Pod level.</p>\n</li>\n<li>\n<p><strong>Deployment</strong> -suffix names: This type of controller does not manage Pods\ndirectly. Instead, it manages one or many <strong>Set</strong> -suffix workload instances which are\ncreated on behalf of one application. The controller can provide capabilities\nto orchestrate the deployment/rollout of multiple instances. For example, <code>Deployment</code>\nmanages <code>ReplicaSet</code> and provides rollout capability which is not available in <code>ReplicaSet</code>.\n<code>UnitedDeployment</code> (planned in <a href=\"(https://github.com/openkruise/kruise/projects)\">M3 release</a>)\nmanages multiple <code>StatefulSet</code> created in respect of multiple domains\n(i.e., fault domains) within one cluster.</p>\n</li>\n<li>\n<p><strong>Job</strong> -suffix names: This type of controller manages batch style applications with\ndifferent depolyment/rollout strategies. For example, <code>BroadcastJob</code> distributes a\njob style Pod to every node in the cluster.</p>\n</li>\n</ul>\n<p><strong>Set</strong>, <strong>Deployment</strong> and <strong>Job</strong> are widely adopted terms in Kubernetes community.\nKruise leverages them with certain extensions.</p>\n<p>Can we further distinguish controllers with the same name suffix? Normally the string prior to\nthe suffix should be self-explainable, but in many cases it is hard to find a right word to\ndescribe what the controller does. Check to see how <code>StatefulSet</code> is originated in\nthis <a href=\"https://github.com/kubernetes/kubernetes/issues/27430\">thread</a>. It takes four\nmonths for community to decide to use the name <code>StatefulSet</code> to replace the original\nname <code>PetSet</code> although the new name still confuse people by looking\nat its API documentation. This example showcases that sometimes a well-thought-out name\nmay not be helpful to identify controller. Again, Kruise does not plan to resolve\nthis problem. As an incremental effort, Kruise considers the following criterion to help classify\n<strong>Set</strong> -suffix controllers.</p>\n<h3>Fixed Pod Name</h3>\n<p>One unique property of <code>StatefulSet</code> is that it maintains consistent identities for\nPod network and storage. Essentially, this is done by fixing Pod names.\nPod name can identify both network and storage since it is part of DNS record and\ncan be used to name Pod volume claim. Why is this property needed given that all Pods in\n<code>StatefulSet</code> are created from the same Pod template?\nA well known use case is to manage distributed coordination server application such as\netcd or Zookeeper. This type of application requires the cluster member\n(i.e., the Pod) to access the same data (in Pod volume) whenever a member is\nreconstructed upon failure, in order to function correctly. To differentiate the term\n<code>State</code> in <code>StatefulSet</code> from the same term used in other computer science areas,\nI'd like to associate <code>State</code> with Pod name in this document. That being said, controllers\nlike <code>ReplicaSet</code> and <code>DaemonSet</code> are <code>Stateless</code> since they don't require to reuse the\nold Pod name when a Pod is recreated.</p>\n<p>Supporting <code>Stateful</code> does lead to inflexibility for controller. <code>StatefulSet</code> relies on ordinal\nnumbers to realize fixing Pod names. The workload rollout and scaling\nhas to be done in a strict order. As a consequence, some useful enhancements to <code>StatefulSet</code>\nbecome impossible. For example,</p>\n<ul>\n<li>Selective Pod upgrade and Pod deletion (when scale in). These features can be helpful\nwhen Pods are spread across different regions or fault domains.</li>\n<li>The ability of taking control over existing Pods with arbitrary names. There are\ncases where Pod creation is done by one controller but Pod lifecycle management\nis done by another controller (e.g., <code>StatefulSet</code>).</li>\n</ul>\n<p>We found that many containerized applications do not require the <code>Stateful</code> property\nof fixing Pod names, and <code>StatefulSet</code> is hard to be extended for those\napplications in many cases. To fill the gap, Kruise is going to release a new controller\ncalled <code>CloneSet</code> to manage the <code>Stateless</code> applications. In a nutshell, <code>CloneSet</code>\nprovides PVC support and enriched rollout and management capabilities.\nThe following table roughly compares Advanced StatefulSet and CloneSet in a few aspects.\nMore details will be available when <code>CloneSet</code> is released (planned in\n<a href=\"https://github.com/openkruise/kruise/projects\">M4 release</a>).</p>\n<table>\n<thead>\n<tr>\n<th>Features</th>\n<th style=\"text-align:center\">Advanced StatefulSet</th>\n<th style=\"text-align:center\">CloneSet</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>PVC</td>\n<td style=\"text-align:center\">Yes</td>\n<td style=\"text-align:center\">Yes</td>\n</tr>\n<tr>\n<td>Pod name</td>\n<td style=\"text-align:center\">Ordered</td>\n<td style=\"text-align:center\">Random</td>\n</tr>\n<tr>\n<td>Inplace upgrade</td>\n<td style=\"text-align:center\">Yes</td>\n<td style=\"text-align:center\">Yes</td>\n</tr>\n<tr>\n<td>Max unavailable</td>\n<td style=\"text-align:center\">Yes</td>\n<td style=\"text-align:center\">Yes</td>\n</tr>\n<tr>\n<td>Selective deletion</td>\n<td style=\"text-align:center\">No</td>\n<td style=\"text-align:center\">Yes</td>\n</tr>\n<tr>\n<td>Selective upgrade</td>\n<td style=\"text-align:center\">No</td>\n<td style=\"text-align:center\">Yes</td>\n</tr>\n<tr>\n<td>Change Pod ownership</td>\n<td style=\"text-align:center\">No</td>\n<td style=\"text-align:center\">Yes</td>\n</tr>\n</tbody>\n</table>\n<p>Certainly, Kruise will continue to improve <code>Advanced StatefulSet</code> for stateful applications.\nHowever, had <code>CloneSet</code> been ready, a clear recommendation to Kruise users would be if your\napplications require fixed Pod names, you can start with <code>Advanced StatefulSet</code>. Otherwise,\n<code>CloneSet</code> is the primary choice of <strong>Set</strong> -suffix controllers (if <code>DaemonSet</code> is not\napplicable).</p>\n<h3>Summary</h3>\n<p>Kruise aims to provide intuitive names for new controllers. As a supplement, this post\nprovides additional guidance for Kruise users to pick the right controller for their\napplications. Hope it helps!</p>\n",
  "link": "/en-us/blog/blog1.html",
  "meta": {
    "title": "Kruise Controller Classification Guidance",
    "keywords": "Kubernetes, controller, Pod, StatefulSet",
    "description": "This blog describes how Kruise classifies different controllers. This can help",
    "Kruise users to identify the best workload for their applications.": ""
  }
}