{
  "filename": "blog3.md",
  "__html": "<h1>UnitedDeploymemt - Supporting Multi-domain Workload Management</h1>\n<p>By FEI GUO (Alibaba), NOVEMBER 20 2019, 6 MINUTE READ</p>\n<p>Ironically, probably every cloud user knew (or should realized that) failures in Cloud resources\nare inevitable. Hence, high availability is probably one of the most desirable features that\nCloud Provider offers for cloud users. For example, in AWS, each geographic region has\nmultiple isolated locations known as Availability Zones (AZs).\nAWS provides various AZ-aware solutions to allow the compute or storage resources of the user\napplications to be distributed across multiple AZs in order to tolerate AZ failure, which indeed\nhappened in the past.</p>\n<p>In Kubernetes, the concept of AZ is not realized by an API object. Instead,\nan AZ is usually represented by a group of hosts that have the same location label.\nAlthough hosts within the same AZ can be identified by labels, the capability of distributing Pods across\nAZs was missing in Kubernetes default scheduler. Hence it was difficult to use single\n<code>StatefulSet</code> or <code>Deployment</code> to perform  AZ-aware Pods deployment. Fortunately,\nin Kubernetes 1.16, a new feature called <a href=\"https://kubernetes.io/docs/concepts/workloads/pods/pod-topology-spread-constraints/\">&quot;Pod Topology Spread Constraints&quot;</a>\nwas introduced. Users now can add new constraints in the Pod Spec, and scheduler\nwill enforce the constraints so that Pods can be distributed across failure\ndomains such as AZs, regions or nodes, in a uniform fashion.</p>\n<p>In Kruise, <strong>UnitedDeploymemt</strong> provides an alternative to achieve high availability in\na cluster that consists of multiple fault domains - that is, managing multiple homogeneous\nworkloads, and each workload is dedicated to a single <code>Subset</code>. Pod distribution across AZs is\ndetermined by the replica number of each workload.\nSince each <code>Subset</code> is associated with a workload, UnitedDeployment can support\nfiner-grained rollout and deployment strategies.\nIn addition, UnitedDeploymemt can be further extended to support\nmultiple clusters! Let us reveal how UnitedDeployment is designed.</p>\n<h2>Using <code>Subsets</code> to describe domain topology</h2>\n<p>UnitedDeploymemt uses <code>Subset</code> to represent a failure domain. <code>Subset</code> API\nprimarily specifies the nodes that forms the domain and the number of replicas, or\nthe percentage of total replicas, run in this domain. UnitedDeployment manages\nsubset workloads against a specific domain topology, described by a <code>Subset</code> array.</p>\n<pre><code>type Topology struct {\n\t// Contains the details of each subset.\n\tSubsets []Subset\n}\n\ntype Subset struct {\n\t// Indicates the name of this subset, which will be used to generate\n\t// subset workload name prefix in the format '&lt;deployment-name&gt;-&lt;subset-name&gt;-'.\n\tName string\n\n\t// Indicates the node select strategy to form the subset.\n\tNodeSelector corev1.NodeSelector\n\n\t// Indicates the number of the subset replicas or percentage of it on the\n\t// UnitedDeployment replicas.\n\tReplicas *intstr.IntOrString\n}\n</code></pre>\n<p>The specification of the subset workload is saved in <code>Spec.Template</code>. UnitedDeployment\nonly supports <code>StatefulSet</code> subset workload as of now. An interesting part of <code>Subset</code>\ndesign is that now user can specify <strong>customized Pod distribution</strong> across AZs, which is not\nnecessarily a uniform distribution in some cases. For example, if the AZ\nutilization or capacity are not homogeneous, evenly distributing Pods may lead to Pod deployment\nfailure due to lack of resources. If users have prior knowledge about AZ resource capacity/usage,\nUnitedDeployment can help to apply an optimal Pod distribution to ensure overall\ncluster utilization remains balanced. Of course, if not specified, a uniform Pod distribution\nwill be applied to maximize availability.</p>\n<h2>Customized subset rollout <code>Partitions</code></h2>\n<p>User can update all the UnitedDeployment subset workloads by providing a\nnew version of subset workload template.\nNote that UnitedDeployment does not control\nthe entire rollout process of all subset workloads, which is typically done by another rollout\ncontroller built on top of it. Since the replica number in each <code>Subset</code> can be different,\nit will be much more convenient to allow user to specify the individual rollout <code>Partition</code> of each\nsubset workload instead of using one <code>Partition</code> to rule all, so that they can be upgraded in the same pace.\nUnitedDeployment provides <code>ManualUpdate</code> strategy to customize per subset rollout <code>Partition</code>.</p>\n<pre><code>type UnitedDeploymentUpdateStrategy struct {\n\t// Type of UnitedDeployment update.\n\tType UpdateStrategyType\n\t// Indicates the partition of each subset.\n\tManualUpdate *ManualUpdate\n}\n\ntype ManualUpdate struct {\n\t// Indicates number of subset partition.\n\tPartitions map[string]int32\n}\n</code></pre>\n<p><img src=\"/img/uniteddeployment-1.png\" alt=\"multi-cluster controller\"></p>\n<p>This makes it fairly easy to coordinate multiple subsets rollout. For example,\nas illustrated in Figure 1, assuming UnitedDeployment manages three subsets and\ntheir replica numbers are 4, 2, 2 respectively, a rollout\ncontroller can realize a canary release plan of upgrading 50% of Pods in each\nsubset at a time by setting subset partitions to 2, 1, 1 respectively.\nThe same cannot be easily achieved by using a single workload controller like <code>StatefulSet</code>\nor <code>Deployment</code>.</p>\n<h2>Multi-Cluster application management (In future)</h2>\n<p>UnitedDeployment can be extended to support multi-cluster workload\nmanagement. The idea is that <code>Subsets</code> may not only\nreside in one cluster, but also spread over multiple clusters.\nMore specifically, domain topology specification will associate\na <code>ClusterRegistryQuerySpec</code>, which describes the clusters that UnitedDeployment\nmay distribute Pods to. Each cluster is represented by a custom resource managed by a\nClusterRegistry controller using Kubernetes <a href=\"https://github.com/kubernetes/cluster-registry\">cluster registry APIs</a>.</p>\n<pre><code>type Topology struct {\n  // ClusterRegistryQuerySpec is used to find the all the clusters that\n  // the workload may be deployed to. \n  ClusterRegistry *ClusterRegistryQuerySpec\n  // Contains the details of each subset including the target cluster name and\n  // the node selector in target cluster.\n  Subsets []Subset\n}\n\ntype ClusterRegistryQuerySpec struct {\n  // Namespaces that the cluster objects reside.\n  // If not specified, default namespace is used.\n  Namespaces []string\n  // Selector is the label matcher to find all qualified clusters.\n  Selector   map[string]string\n  // Describe the kind and APIversion of the cluster object.\n  ClusterType metav1.TypeMeta\n}\n\ntype Subset struct {\n  Name string\n\n  // The name of target cluster. The controller will validate that\n  // the TargetCluster exits based on Topology.ClusterRegistry.\n  TargetCluster *TargetCluster\n\n  // Indicate the node select strategy in the Subset.TargetCluster.\n  // If Subset.TargetCluster is not set, node selector strategy refers to\n  // current cluster.\n  NodeSelector corev1.NodeSelector\n\n  Replicas *intstr.IntOrString \n}\n\ntype TargetCluster struct {\n  // Namespace of the target cluster CRD\n  Namespace string\n  // Target cluster name\n  Name string\n}\n</code></pre>\n<p>A new <code>TargetCluster</code> field is added to the <code>Subset</code> API. If it presents, the\n<code>NodeSelector</code> indicates the node selection logic in the target cluster. Now\nUnitedDeployment controller can distribute application Pods to multiple clusters by\ninstantiating a <code>StatefulSet</code> workload in each target cluster with a specific\nreplica number (or a percentage of total replica), as illustrated in Figure 2.</p>\n<p><img src=\"/img/uniteddeployment-2.png\" alt=\"multi-cluster\tcontroller\"></p>\n<p>At a first glance, UnitedDeployment looks more like a federation\ncontroller following the design pattern of <a href=\"https://github.com/kubernetes-sigs/kubefed\">Kubefed</a>,\nbut it isn't. The fundamental difference is that Kubefed focuses on propagating arbitrary\nobject types to remote clusters instead of managing an application across clusters.\nIn this example, had a Kubefed style controller been used, each <code>StatefulSet</code> workload in\nindividual cluster would have a replica of 100. UnitedDeployment focuses more on\nproviding the ability of managing multiple workloads in multiple clusters on behalf\nof one application, which is absent in Kubernetes community to the best of our\nknowledge.</p>\n<h2>Summary</h2>\n<p>This blog post introduces UnitedDeployment, a new controller which helps managing\napplication spread over multiple domains (in arbitrary clusters).\nIt not only allows evenly distributing Pods over AZs,\nwhich arguably can be more efficiently done using the new Pod Topology Spread\nConstraint APIs though, but also enables flexible workload deployment/rollout and\nsupports multi-cluster use cases in the future.</p>\n",
  "link": "/en-us/blog/blog3.html",
  "meta": {
    "title": "UnitedDeploymemt - Supporting Multi-domain Workload Management",
    "keywords": "Kubernetes, controller"
  }
}