{
  "filename": "what_is_openkruise.md",
  "__html": "<h1 id=\"what-is-openkruise\">What is OpenKruise <a class=\"header-anchor\" href=\"#what-is-openkruise\">#</a></h1>\n<p>Welcome to OpenKruise!</p>\n<p>OpenKruise is a full set of standard extensions for Kubernetes. It works well with original Kubernetes and provides more powerful and efficient features for managing applications Pods, sidecar containers, and even images on Node.</p>\n<h2 id=\"key-features\">Key features <a class=\"header-anchor\" href=\"#key-features\">#</a></h2>\n<ul>\n<li>\n<p><strong>In-place update</strong></p>\n<p>In-place update is a way to update container images without deleting and creating Pod. It is quite faster than re-create update used by original Deployment/StatefulSet and less side-effect on other containers.</p>\n</li>\n<li>\n<p><strong>Sidecar management</strong></p>\n<p>Define sidecar containers in one CR and OpenKruise will inject them into all Pods matched. It's just like istio, but you can manage your own sidecars.</p>\n</li>\n<li>\n<p><strong>Multiple fault domains deployment</strong></p>\n<p>Define a global workload over multiple fault domains, and OpenKruise will spread a sub workload for each domain. You can manage replicas, template and update strategies for workloads in different fault domains.</p>\n</li>\n<li>\n<p><strong>Image pre-download</strong></p>\n<p>Help users download images on any nodes they want.</p>\n</li>\n<li>\n<p><strong>Container recreate/restart</strong></p>\n<p>Help users restart/recreate one or more containers in an existing Pod.</p>\n</li>\n<li>\n<p><strong>...</strong></p>\n</li>\n</ul>\n<h2 id=\"controllers-and-webhooks\">Controllers and Webhooks <a class=\"header-anchor\" href=\"#controllers-and-webhooks\">#</a></h2>\n<ul>\n<li>\n<p><strong>CloneSet</strong></p>\n<p>CloneSet is a workload that mainly focuses on managing stateless applications. It provides full features for more efficient, deterministic and controlled deployment, such as inplace update, specified pod deletion, configurable priority/scatter update, preUpdate/postUpdate hooks.</p>\n</li>\n<li>\n<p><strong>Advanced StatefulSet</strong></p>\n<p>An enhanced version of default StatefulSet with extra functionalities such as inplace-update, pause and MaxUnavailable.</p>\n</li>\n<li>\n<p><strong>SidecarSet</strong></p>\n<p>A controller that injects sidecar containers into the Pod spec based on selectors and also is able to upgrade the sidecar containers.</p>\n</li>\n<li>\n<p><strong>WorkloadSpread</strong></p>\n<p>Constrain the spread of stateless workload, which empower single workload the abilities for multi-domain deploy and elastic deploy.</p>\n</li>\n<li>\n<p><strong>UnitedDeployment</strong></p>\n<p>This controller manages application pods spread in multiple fault domains by using multiple workloads.</p>\n</li>\n<li>\n<p><strong>BroadcastJob</strong></p>\n<p>A job that runs Pods to completion across all the nodes in the cluster.</p>\n</li>\n<li>\n<p><strong>Advanced DaemonSet</strong></p>\n<p>An enhanced version of default DaemonSet with extra functionalities such as partition, node selector, pause and surging.</p>\n</li>\n<li>\n<p><strong>AdvancedCronJob</strong></p>\n<p>An extended CronJob controller, currently its template supports Job and BroadcastJob.</p>\n</li>\n<li>\n<p><strong>ImagePullJob</strong></p>\n<p>Help users download images on any nodes they want.</p>\n</li>\n<li>\n<p><strong>ContainerRecreateRequest</strong></p>\n<p>Provides a way to let users restart/recreate one or more containers in an existing Pod.</p>\n</li>\n<li>\n<p><strong>Deletion Protection</strong></p>\n<p>Provides a safety policy which could help users protect Kubernetes resources and applications' availability from the cascading deletion mechanism.</p>\n</li>\n<li>\n<p><strong>PodUnavailableBudget</strong></p>\n<p>In voluntary disruption scenarios, PodUnavailableBudget can achieve the effect of preventing application disruption or SLA degradation, which greatly improves the high availability of application services.</p>\n</li>\n</ul>\n",
  "link": "/en-us/docs/what_is_openkruise.html",
  "meta": {
    "title": "What is OpenKruise"
  }
}